run/flatplate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.04 0 0)
    (0.08 0 0)
    (1.14 0 0)
    (3.04 0 0)
    (0 1 0)
    (0.04 1 0)
    (0.08 1 0)
    (1.14 1 0)
    (3.04 1 0)
    (0 0 0.1)
    (0.04 0 0.1)
    (0.08 0 0.1)
    (1.14 0 0.1)
    (3.04 0 0.1)
    (0 1 0.1)
    (0.04 1 0.1)
    (0.08 1 0.1)
    (1.14 1 0.1)
    (3.04 1 0.1)
);

blocks
(
    hex (0 1 6 5 10 11 16 15) (40 80 1) simpleGrading (0.0222 700 1)
    hex (1 2 7 6 11 12 17 16) (40 80 1) simpleGrading (45 700 1)
    hex (2 3 8 7 12 13 18 17) (160 80 1) simpleGrading (1 700 1)
    hex (3 4 9 8 13 14 19 18) (60 80 1) simpleGrading (13 700 1)
);

edges
(
);

boundary
(
    fixedWall
    {
        type wall;
        faces
        (
            (1 2 12 11)
            (2 3 13 12)
            (3 4 14 13)            
        );
    }
    above
    {
        type patch;
        faces
        (
            (0 1 11 10)                     
        );
    }
    top
    {
        type patch;
        faces
        (
            (5 15 16 6)
            (6 16 17 7)
            (7 17 18 8)
            (8 18 19 9)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 10 15 5)
        );
     }
    outlet
    {
        type patch;
        faces
        (
            (4 14 19 9)
        );
     }

);

mergePatchPairs
(
);

// ************************************************************************* //
